Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK0512GPK100.PIC
      <edc:SFRDef edc:_addr="0x1F887120" edc:_begin="0xe0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="4" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN3" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCCMPEN3" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE20" edc:mask="0x1" edc:name="CMPE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE21" edc:mask="0x1" edc:name="CMPE21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE22" edc:mask="0x1" edc:name="CMPE22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE23" edc:mask="0x1" edc:name="CMPE23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE24" edc:mask="0x1" edc:name="CMPE24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE25" edc:mask="0x1" edc:name="CMPE25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE26" edc:mask="0x1" edc:name="CMPE26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE27" edc:mask="0x1" edc:name="CMPE27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887130" edc:_begin="0xe0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMP3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCMP3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCMPLO" edc:mask="0xffff" edc:name="DCMPLO" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DCMPHI" edc:mask="0xffff" edc:name="DCMPHI" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887140" edc:_begin="0xe0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="5" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCMPEN4" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCCMPEN4" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPE0" edc:mask="0x1" edc:name="CMPE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE1" edc:mask="0x1" edc:name="CMPE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE2" edc:mask="0x1" edc:name="CMPE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE3" edc:mask="0x1" edc:name="CMPE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE4" edc:mask="0x1" edc:name="CMPE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE5" edc:mask="0x1" edc:name="CMPE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE6" edc:mask="0x1" edc:name="CMPE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE7" edc:mask="0x1" edc:name="CMPE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE8" edc:mask="0x1" edc:name="CMPE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE9" edc:mask="0x1" edc:name="CMPE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE10" edc:mask="0x1" edc:name="CMPE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE11" edc:mask="0x1" edc:name="CMPE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE12" edc:mask="0x1" edc:name="CMPE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE13" edc:mask="0x1" edc:name="CMPE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE14" edc:mask="0x1" edc:name="CMPE14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE15" edc:mask="0x1" edc:name="CMPE15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE16" edc:mask="0x1" edc:name="CMPE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE17" edc:mask="0x1" edc:name="CMPE17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE18" edc:mask="0x1" edc:name="CMPE18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE19" edc:mask="0x1" edc:name="CMPE19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE20" edc:mask="0x1" edc:name="CMPE20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE21" edc:mask="0x1" edc:name="CMPE21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE22" edc:mask="0x1" edc:name="CMPE22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE23" edc:mask="0x1" edc:name="CMPE23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE24" edc:mask="0x1" edc:name="CMPE24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE25" edc:mask="0x1" edc:name="CMPE25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE26" edc:mask="0x1" edc:name="CMPE26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPE27" edc:mask="0x1" edc:name="CMPE27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
