Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/edc/PIC32MK0512GPK100.PIC
      <edc:SFRDef edc:_addr="0x1F887360" edc:_begin="0x220" edc:_end="0x230" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="17" edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC1TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC1TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887370" edc:_begin="0x220" edc:_end="0x230" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="18" edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC2TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC2TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887380" edc:_begin="0x220" edc:_end="0x230" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="19" edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC3TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC3TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887390" edc:_begin="0x220" edc:_end="0x230" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="20" edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC4TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC4TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873A0" edc:_begin="0x220" edc:_end="0x230" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="21" edc:access="---nnnnnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC5TIME" edc:desc="" edc:impl="0x1fff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000u0000000------0000000000" edc:name="ADC5TIME" edc:nzwidth="32" edc:por="---00000x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN" edc:mask="0x1" edc:name="BCHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:mask="0x7" edc:name="ADCEIS" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8873B0" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8873C0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCEIEN1" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCEIQEN1" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIEN0" edc:mask="0x1" edc:name="EIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN1" edc:mask="0x1" edc:name="EIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN2" edc:mask="0x1" edc:name="EIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN3" edc:mask="0x1" edc:name="EIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN4" edc:mask="0x1" edc:name="EIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN5" edc:mask="0x1" edc:name="EIEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN6" edc:mask="0x1" edc:name="EIEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN7" edc:mask="0x1" edc:name="EIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN8" edc:mask="0x1" edc:name="EIEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN9" edc:mask="0x1" edc:name="EIEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN10" edc:mask="0x1" edc:name="EIEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN11" edc:mask="0x1" edc:name="EIEN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN12" edc:mask="0x1" edc:name="EIEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN13" edc:mask="0x1" edc:name="EIEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN14" edc:mask="0x1" edc:name="EIEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN15" edc:mask="0x1" edc:name="EIEN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN16" edc:mask="0x1" edc:name="EIEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN17" edc:mask="0x1" edc:name="EIEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN18" edc:mask="0x1" edc:name="EIEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN19" edc:mask="0x1" edc:name="EIEN19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN20" edc:mask="0x1" edc:name="EIEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN21" edc:mask="0x1" edc:name="EIEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN22" edc:mask="0x1" edc:name="EIEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN23" edc:mask="0x1" edc:name="EIEN23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN24" edc:mask="0x1" edc:name="EIEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN25" edc:mask="0x1" edc:name="EIEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN26" edc:mask="0x1" edc:name="EIEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN27" edc:mask="0x1" edc:name="EIEN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873D0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----------nnnnnnnnn---nnnnnnnnn-" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x3fe3fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000000---000000000-" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="----------000000000---000000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN33" edc:mask="0x1" edc:name="EIEN33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN34" edc:mask="0x1" edc:name="EIEN34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN35" edc:mask="0x1" edc:name="EIEN35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN36" edc:mask="0x1" edc:name="EIEN36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN37" edc:mask="0x1" edc:name="EIEN37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN38" edc:mask="0x1" edc:name="EIEN38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN39" edc:mask="0x1" edc:name="EIEN39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN40" edc:mask="0x1" edc:name="EIEN40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN41" edc:mask="0x1" edc:name="EIEN41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="EIEN45" edc:mask="0x1" edc:name="EIEN45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN46" edc:mask="0x1" edc:name="EIEN46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN47" edc:mask="0x1" edc:name="EIEN47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN48" edc:mask="0x1" edc:name="EIEN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN49" edc:mask="0x1" edc:name="EIEN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN50" edc:mask="0x1" edc:name="EIEN50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN51" edc:mask="0x1" edc:name="EIEN51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN52" edc:mask="0x1" edc:name="EIEN52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN53" edc:mask="0x1" edc:name="EIEN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873E0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----rrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="----0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY19" edc:mask="0x1" edc:name="EIRDY19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY20" edc:mask="0x1" edc:name="EIRDY20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY21" edc:mask="0x1" edc:name="EIRDY21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY22" edc:mask="0x1" edc:name="EIRDY22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY23" edc:mask="0x1" edc:name="EIRDY23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY24" edc:mask="0x1" edc:name="EIRDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY25" edc:mask="0x1" edc:name="EIRDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY26" edc:mask="0x1" edc:name="EIRDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY27" edc:mask="0x1" edc:name="EIRDY27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873F0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----------nnnnnnrrr---rrrrrrrrr-" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0x3fe3fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu000---000000000-" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="----------xxxxxx000---000000000-" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY33" edc:mask="0x1" edc:name="EIRDY33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY34" edc:mask="0x1" edc:name="EIRDY34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY35" edc:mask="0x1" edc:name="EIRDY35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY36" edc:mask="0x1" edc:name="EIRDY36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY37" edc:mask="0x1" edc:name="EIRDY37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY38" edc:mask="0x1" edc:name="EIRDY38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY39" edc:mask="0x1" edc:name="EIRDY39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY40" edc:mask="0x1" edc:name="EIRDY40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY41" edc:mask="0x1" edc:name="EIRDY41" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="EIRDY45" edc:mask="0x1" edc:name="EIRDY45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY46" edc:mask="0x1" edc:name="EIRDY46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY47" edc:mask="0x1" edc:name="EIRDY47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY48" edc:mask="0x1" edc:name="EIRDY48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY49" edc:mask="0x1" edc:name="EIRDY49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY50" edc:mask="0x1" edc:name="EIRDY50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY51" edc:mask="0x1" edc:name="EIRDY51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY52" edc:mask="0x1" edc:name="EIRDY52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY53" edc:mask="0x1" edc:name="EIRDY53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887400" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----nnnnn-nnnnnnr-rrrrrrn-nnnnnn" edc:cname="ADCANCON" edc:desc="" edc:impl="0xfbfbfbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000-u000000-0000000-000000" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000-x000000-0000000-000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN1" edc:mask="0x1" edc:name="ANEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN2" edc:mask="0x1" edc:name="ANEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN3" edc:mask="0x1" edc:name="ANEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN4" edc:mask="0x1" edc:name="ANEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN5" edc:mask="0x1" edc:name="ANEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY1" edc:mask="0x1" edc:name="WKRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY2" edc:mask="0x1" edc:name="WKRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY3" edc:mask="0x1" edc:name="WKRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY4" edc:mask="0x1" edc:name="WKRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY5" edc:mask="0x1" edc:name="WKRDY5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN1" edc:mask="0x1" edc:name="WKIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN2" edc:mask="0x1" edc:name="WKIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN3" edc:mask="0x1" edc:name="WKIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN4" edc:mask="0x1" edc:name="WKIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN5" edc:mask="0x1" edc:name="WKIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F887410" edc:offset="0x1F0"/>
      <edc:SFRDef edc:_addr="0x1F887600" edc:_begin="0x320" edc:_end="0x680" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="23" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
